espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/components/ble/ble_services/ble_ancs_c/ble_ancs_c.c
static tx_message_t m_tx_buffer[TX_BUFFER_SIZE];                           /**< Transmit buffer for messages to be transmitted to the Notification Provider. */
static uint32_t     m_tx_insert_index = 0;                                 /**< Current index in the transmit buffer where the next message should be inserted. */
static uint32_t     m_tx_index        = 0;                                 /**< Current index in the transmit buffer from where the next message to be transmitted resides. */

static ble_ancs_c_service_t   m_service;                                   /**< Current service data. */
static ble_ancs_c_t         * mp_ble_ancs;                                 /**< Pointer to the current instance of the ANCS client module. The memory for this is provided by the application.*/
static ble_ancs_c_attr_list_t m_ancs_attr_list[BLE_ANCS_NB_OF_ATTRS];      /**< For all attributes; contains whether they should be requested upon attribute request and the length and buffer of where to store attribute data. */
static uint32_t               m_expected_number_of_attrs;                  /**< Variable to keep track of when to stop reading incoming attributes. */
static ble_ancs_c_evt_t       m_ancs_evt;                                  /**< The ANCS event that is created in this module and propagated to the application. */

static ble_ancs_c_parse_state_t m_parse_state = COMMAND_ID_AND_NOTIF_UID;  /**< ANCS notification attribute parsing state. */


/**@brief 128-bit service UUID for the Apple Notification Center Service.
 */
const ble_uuid128_t ble_ancs_base_uuid128 =
{
    {
        // 7905F431-B5CE-4E99-A40F-4B1E122D00D0
        0xd0, 0x00, 0x2d, 0x12, 0x1e, 0x4b, 0x0f, 0xa4,
        0x99, 0x4e, 0xce, 0xb5, 0x31, 0xf4, 0x05, 0x79
    }
};


/**@brief 128-bit control point UUID.
 */
const ble_uuid128_t ble_ancs_cp_base_uuid128 =
{
    {
        // 69d1d8f3-45e1-49a8-9821-9BBDFDAAD9D9
        0xd9, 0xd9, 0xaa, 0xfd, 0xbd, 0x9b, 0x21, 0x98,
        0xa8, 0x49, 0xe1, 0x45, 0xf3, 0xd8, 0xd1, 0x69
    }
};

/**@brief 128-bit notification source UUID.
*/
const ble_uuid128_t ble_ancs_ns_base_uuid128 =
{
    {
        // 9FBF120D-6301-42D9-8C58-25E699A21DBD
        0xbd, 0x1d, 0xa2, 0x99, 0xe6, 0x25, 0x58, 0x8c,
        0xd9, 0x42, 0x01, 0x63, 0x0d, 0x12, 0xbf, 0x9f

    }
};

/**@brief 128-bit data source UUID.
*/
const ble_uuid128_t ble_ancs_ds_base_uuid128 =
{
    {
        // 22EAC6E9-24D6-4BB5-BE44-B36ACE7C7BFB
        0xfb, 0x7b, 0x7c, 0xce, 0x6a, 0xb3, 0x44, 0xbe,
        0xb5, 0x4b, 0xd6, 0x24, 0xe9, 0xc6, 0xea, 0x22
    }
};


/**@brief Function for handling events from the database discovery module.
 *
 * @details This function handles events from the database discovery module and determines
 *          if it relates to the discovery of the Apple Notification Center Service at the 
 *          peer. If so, it will call the application's event handler indicating that the Apple
 *          Notification Center Service has been discovered at the peer. It also populates the
 *          event with the service-related information before providing it to the application.
 *
 * @param[in] p_evt Pointer to the event received from the database discovery module.
 */
static void db_discover_evt_handler(ble_db_discovery_evt_t * p_evt)
{
    LOG("[ANCS]: Database Discovery handler called with event 0x%x\r\n", p_evt->evt_type);

    ble_ancs_c_evt_t evt;
    ble_db_discovery_char_t * p_chars;

    p_chars = p_evt->params.discovered_db.charateristics;

    // Check if the ANCS Service was discovered.
    if (p_evt->evt_type == BLE_DB_DISCOVERY_COMPLETE &&
        p_evt->params.discovered_db.srv_uuid.uuid == ANCS_UUID_SERVICE &&
        p_evt->params.discovered_db.srv_uuid.type == BLE_UUID_TYPE_VENDOR_BEGIN)
    {
        mp_ble_ancs->conn_handle = p_evt->conn_handle;

        // Find the handles of the ANCS characteristic.
        uint32_t i;

        for (i = 0; i < p_evt->params.discovered_db.char_count; i++)
        {
            switch (p_evt->params.discovered_db.charateristics[i].characteristic.uuid.uuid)
            {
                case ANCS_UUID_CHAR_CONTROL_POINT:
                    LOG("[ANCS]: Control Point Characteristic found.\n\r");
                    m_service.control_point.properties   = p_chars[i].characteristic.char_props;
                    m_service.control_point.handle_decl  = p_chars[i].characteristic.handle_decl;
                    m_service.control_point.handle_value = p_chars[i].characteristic.handle_value;
                    m_service.control_point.handle_cccd  = p_chars[i].cccd_handle;
                    break;

                case ANCS_UUID_CHAR_DATA_SOURCE:
                    LOG("[ANCS]: Data Source Characteristic found.\n\r");
                    m_service.data_source.properties   = p_chars[i].characteristic.char_props;
                    m_service.data_source.handle_decl  = p_chars[i].characteristic.handle_decl;
                    m_service.data_source.handle_value = p_chars[i].characteristic.handle_value;
                    m_service.data_source.handle_cccd  = p_chars[i].cccd_handle;
                    break;

                case ANCS_UUID_CHAR_NOTIFICATION_SOURCE:
                    LOG("[ANCS]: Notification point Characteristic found.\n\r");
                    m_service.notif_source.properties   = p_chars[i].characteristic.char_props;
                    m_service.notif_source.handle_decl  = p_chars[i].characteristic.handle_decl;
                    m_service.notif_source.handle_value = p_chars[i].characteristic.handle_value;
                    m_service.notif_source.handle_cccd  = p_chars[i].cccd_handle;
                    break;

                default:
                    break;
            }
        }
        evt.evt_type = BLE_ANCS_C_EVT_DISCOVER_COMPLETE;
        mp_ble_ancs->evt_handler(&evt);
    }
    else
    {
        evt.evt_type = BLE_ANCS_C_EVT_DISCOVER_FAILED;
        mp_ble_ancs->evt_handler(&evt);
    }
}


/**@brief Function for passing any pending request from the buffer to the stack.
 */
static void tx_buffer_process(void)
{
    if (m_tx_index != m_tx_insert_index)
    {
        uint32_t err_code;

        if (m_tx_buffer[m_tx_index].type == READ_REQ)
        {
            err_code = sd_ble_gattc_read(m_tx_buffer[m_tx_index].conn_handle,
                                         m_tx_buffer[m_tx_index].req.read_handle,
                                         0);
        }
        else
        {
            err_code = sd_ble_gattc_write(m_tx_buffer[m_tx_index].conn_handle,
                                          &m_tx_buffer[m_tx_index].req.write_req.gattc_params);
        }
        if (err_code == NRF_SUCCESS)
        {
            ++m_tx_index;
            m_tx_index &= TX_BUFFER_MASK;
        }
    }
}


