espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/components/ble/ble_services/ble_ancs_c/ble_ancs_c.c
/**@brief Function for parsing received notification attribute response data.
 *
 * @details The data that comes from the Notification Provider can be much longer than what
 *          would fit in a single GATTC notification. Therefore, function relies on static
 *          variables and a state-oriented switch case.
 *          UID and command ID will be received only once at the beginning of the first 
 *          GATTC notification of a new attribute request for a given iOS notification.
 *          After this, we can loop several ID > LENGTH > DATA > ID > LENGTH > DATA until we have
 *          received all attributes we wanted as a Notification Consumer. The Notification Provider
 *          can also simply stop sending attributes.
 *
 * @param[in] p_ancs     Pointer to an ANCS instance to which the event belongs.
 * @param[in] p_data_src Pointer to data that was received from the Notification Provider.
 * @param[in] hvx_len    Length of the data that was received from the Notification Provider.
 */
static void parse_get_notif_attrs_response(ble_ancs_c_t  * p_ancs,
                                           const uint8_t * p_data_src,
                                           const uint16_t  hvx_data_len)
{
    static uint8_t               * p_data_dest;
    static uint16_t                current_attr_index;
    static ble_ancs_c_evt_t        evt;
    ble_ancs_c_command_id_values_t command_id;
    uint32_t                       index;

    evt.ancs_attr_list = m_ancs_attr_list;

    for (index = 0; index < hvx_data_len;)
    {
        switch (m_parse_state)
        {
            case COMMAND_ID_AND_NOTIF_UID:
                command_id = (ble_ancs_c_command_id_values_t) p_data_src[index++];
                if(command_id != BLE_ANCS_COMMAND_ID_GET_NOTIF_ATTRIBUTES)
                {
                    LOG("[ANCS]: Invalid Command ID");
                    m_parse_state = DONE;
                }

                evt.attr.notif_uid  = uint32_decode(&p_data_src[index]);
                index              += sizeof(uint32_t);
                m_parse_state       = ATTR_ID;

                if (evt.attr.notif_uid != m_ancs_evt.notif.notif_uid)
                {
                    LOG("UID mismatch: Notification UID %x , Attribute UID %x\n\r",
                        evt.notif.notif_uid,
                        evt.attr.notif_uid);
                    m_parse_state = DONE;
                }
                break;

            case ATTR_ID:
                if (m_expected_number_of_attrs == 0)
                {
                    LOG("[ANCS]: All requested attributes received\n\r");
                    m_parse_state = DONE;
                    index++;
                }
                else
                {
                    evt.attr.attr_id = (ble_ancs_c_notif_attr_id_values_t) p_data_src[index++];
                    p_data_dest        = m_ancs_attr_list[evt.attr.attr_id].p_attr_data;
                    if (m_ancs_attr_list[evt.attr.attr_id].get == true)
                    {
                        m_parse_state = ATTR_LEN1;
                    }
                    m_expected_number_of_attrs--;
                    LOG("Attribute ID %i \n\r", evt.attr.attr_id);
                }
                break;

            case ATTR_LEN1:
                evt.attr.attr_len = p_data_src[index++];
                m_parse_state       = ATTR_LEN2;
                break;

            case ATTR_LEN2:
                evt.attr.attr_len |= (p_data_src[index++] << 8);
                current_attr_index   = 0;
                if (evt.attr.attr_len != 0)
                {
                    m_parse_state = ATTR_DATA;
                }
                else
                {
                    evt.evt_type = BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE;
                    p_ancs->evt_handler(&evt);
                    m_parse_state = ATTR_ID;
                }
                LOG("Attribute LEN %i \n\r", evt.attr.attr_len);
                break;

            case ATTR_DATA:
                // We have not reached the end of the attribute, nor our max allocated internal size.
                // Proceed with copying data over to our buffer.
                if (   (current_attr_index < m_ancs_attr_list[evt.attr.attr_id].attr_len)
                    && (current_attr_index < evt.attr.attr_len))
                {
                    p_data_dest[current_attr_index++] = p_data_src[index++];
                }
                // We have reached the end of the attribute, or our max allocated internal size.
                // Stop copying data over to our buffer. NUL-terminate at the current index.
                if ( (current_attr_index == evt.attr.attr_len) ||
                     (current_attr_index == m_ancs_attr_list[evt.attr.attr_id].attr_len))
                {
                    p_data_dest[current_attr_index] = '\0';
                    
                    // If our max buffer size is smaller than the remaining attribute data, we must
                    // increase index to skip the data until the start of the next attribute.
                    if (current_attr_index < evt.attr.attr_len)
                    {
                        index += (evt.attr.attr_len - current_attr_index);
                    }
                    m_parse_state = ATTR_ID;
                    LOG("Attribute finished!\n\r");
                    evt.evt_type = BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE;
                    p_ancs->evt_handler(&evt);
                }
                break;

            case DONE:
                index = hvx_data_len;
                break;

            default:
                // Default case will never trigger intentionally. Go to the DONE state to minimize the consequences.
                m_parse_state = DONE;
                break;
        }
    }
}


/**@brief Function for checking if data in an iOS notification is out of bounds.
 *
 * @param[in] notif  An iOS notification.
 *
 * @retval NRF_SUCCESS             If the notification is within bounds.
 * @retval NRF_ERROR_INVALID_PARAM If the notification is out of bounds.
 */
static uint32_t ble_ancs_verify_notification_format(const ble_ancs_c_evt_notif_t * notif)
{
    if(   (notif->evt_id >= BLE_ANCS_NB_OF_EVT_ID)
       || (notif->category_id >= BLE_ANCS_NB_OF_CATEGORY_ID))
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    return NRF_SUCCESS;
}

