espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/components/ble/ble_services/ble_ancs_c/ble_ancs_c.c
    tx_buffer_process();
    return NRF_SUCCESS;
}


uint32_t ble_ancs_c_notif_source_notif_enable(const ble_ancs_c_t * p_ancs)
{
    LOG("[ANCS]: Enable Notification Source notifications. writing to handle: %i \n\r",
        m_service.notif_source.handle_cccd);
    return cccd_configure(p_ancs->conn_handle, m_service.notif_source.handle_cccd, true);
}


uint32_t ble_ancs_c_notif_source_notif_disable(const ble_ancs_c_t * p_ancs)
{
    return cccd_configure(p_ancs->conn_handle, m_service.notif_source.handle_cccd, false);
}


uint32_t ble_ancs_c_data_source_notif_enable(const ble_ancs_c_t * p_ancs)
{
    LOG("[ANCS]: Enable Data Source notifications. Writing to handle: %i \n\r",
        m_service.data_source.handle_cccd);
    return cccd_configure(p_ancs->conn_handle, m_service.data_source.handle_cccd, true);
}


uint32_t ble_ancs_c_data_source_notif_disable(const ble_ancs_c_t * p_ancs)
{
    return cccd_configure(p_ancs->conn_handle, m_service.data_source.handle_cccd, false);
}


uint32_t ble_ancs_get_notif_attrs(const ble_ancs_c_t * p_ancs,
                                  const uint32_t       p_uid)
{
    tx_message_t * p_msg;
    uint32_t       index                    = 0;
    uint32_t       number_of_requested_attr = 0;

    p_msg              = &m_tx_buffer[m_tx_insert_index++];
    m_tx_insert_index &= TX_BUFFER_MASK;

    p_msg->req.write_req.gattc_params.handle   = m_service.control_point.handle_value;
    p_msg->req.write_req.gattc_params.p_value  = p_msg->req.write_req.gattc_value;
    p_msg->req.write_req.gattc_params.offset   = 0;
    p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_REQ;

    //Encode Command ID.
    p_msg->req.write_req.gattc_value[index++] = BLE_ANCS_COMMAND_ID_GET_NOTIF_ATTRIBUTES;
    
    //Encode Notification UID.
    index += uint32_encode(p_uid, &p_msg->req.write_req.gattc_value[index]);

    //Encode Attribute ID.
    for (uint32_t attr = 0; attr < BLE_ANCS_NB_OF_ATTRS; attr++)
    {
        if (m_ancs_attr_list[attr].get == true)
        {
            p_msg->req.write_req.gattc_value[index++] = attr;
            if ((attr == BLE_ANCS_NOTIF_ATTR_ID_TITLE) ||
                (attr == BLE_ANCS_NOTIF_ATTR_ID_SUBTITLE) ||
                (attr == BLE_ANCS_NOTIF_ATTR_ID_MESSAGE))
            {
                //Encode Length field, only applicable for Title, Subtitle and Message
                index += uint16_encode(m_ancs_attr_list[attr].attr_len,
                              &p_msg->req.write_req.gattc_value[index]);
            }
            number_of_requested_attr++;
        }
    }
    p_msg->req.write_req.gattc_params.len = index;
    p_msg->conn_handle                    = p_ancs->conn_handle;
    p_msg->type                           = WRITE_REQ;
    m_expected_number_of_attrs            = number_of_requested_attr;

    tx_buffer_process();

    return NRF_SUCCESS;
}


uint32_t ble_ancs_c_attr_add(const ble_ancs_c_notif_attr_id_values_t id,
                             uint8_t                               * p_data,
                             const uint16_t                          len)
{
    if(p_data == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if((len == 0) || (len > BLE_ANCS_ATTR_DATA_MAX))
    {
        return NRF_ERROR_INVALID_LENGTH;
    }

    m_ancs_attr_list[id].get         = true;
    m_ancs_attr_list[id].attr_len    = len;
    m_ancs_attr_list[id].p_attr_data = p_data;

    return NRF_SUCCESS;
}


uint32_t ble_ancs_c_request_attrs(const ble_ancs_c_evt_notif_t * notif)
{
    uint32_t err_code;
    err_code = ble_ancs_verify_notification_format(notif);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code      = ble_ancs_get_notif_attrs(mp_ble_ancs, notif->notif_uid);
    m_parse_state = COMMAND_ID_AND_NOTIF_UID;
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    return NRF_SUCCESS;
}

